[
  {
    "name": "Mickey Mouse",
    "photo": "https://static.wikia.nocookie.net/disney/images/b/bf/Mickey_Mouse_Disney_1.png",
    "quote": "When people laugh at Mickey Mouse, it's because he's so human; and that is the secret of his popularity. I only hope that we don't lose sight of one thing — that it was all started by a mouse.",
    "quote_by": "Walt Disney",
    "about": "Mickey Mouse is an animated character created by Walt Disney and Ub Iwerks. A cheerful and plucky anthropomorphic mouse, Mickey made his first public appearance in Steamboat Willie, on November 18, 1928. Estimated as standing 2' 3\" (68.58 centimeters) and weighing 23 pounds (10 kilograms), Mickey is easily identified by his round ears, red shorts, white gloves, and yellow shoes. He speaks in a falsetto voice, and his speech is typically infused with 1930s slang like \"swell\" and \"gee\". The essence of Mickey’s character is that of an underdog who, despite being small and vulnerable, overcomes larger-than-life adversity through quick wit and a can-do spirit."
  },
  {
    "name": "Goofy",
    "photo": "https://static.wikia.nocookie.net/disney/images/2/27/Goofy_transparent.png",
    "quote": "Though he seems intoxicated, he's just highly animated!",
    "quote_by": "Max Goof",
    "about": "Goofy is an animated character that first appeared in 1932's Mickey's Revue. Named for his clumsiness and ineptitude, he is an anthropomorphic dog characterized as a hick with a southern drawl. Goofy is predominately known for his slapstick style of comedy, and regularly appears alongside his best friends Mickey Mouse and Donald Duck."
  },
  {
    "name": "Minnie Mouse",
    "photo": "https://static.wikia.nocookie.net/disney/images/3/36/Minnie_Mouse_pose_.jpg",
    "quote": "Gosh, Minnie, you've always been a princess to me.",
    "quote_by": "Mickey Mouse",
    "about": "Minnie Mouse is an animated, anthropomorphic mouse character created by Walt Disney. She is the longtime girlfriend of Mickey Mouse, known for her sweet disposition, large head bows, and polka-dotted dresses. She is also identified by her signature catchphrase, “Yoo-hoo!”, which she affectionately calls out as a greeting. Inspired by flapper girls of the 1920s, Minnie first appeared in the short Steamboat Willie, released on November 18, 1928."
  },
  {
    "name": "Donald Duck",
    "photo": "https://static.wikia.nocookie.net/disney/images/d/db/Donald_Duck_Iconic.png",
    "quote": "One of the greatest satisfactions in our work here at the studio is the warm relationship that exists within our cartoon family. Mickey, Pluto, Goofy, and the whole gang have always been a lot of fun to work with. But like many large families, we have a problem child. You're right, it's Donald Duck.",
    "quote_by": "Walt Disney",
    "about": "Donald Duck (or simply referred to as “The Duck”[14]) is an animated character created by Walt Disney as a foil to Mickey Mouse.[15] Making his screen debut in The Wise Little Hen on June 9, 1934, Donald is characterized as a pompous, showboating duck wearing a sailor suit, cap and a bow tie. Along with his semi-unintelligible voice (as famously created by his original voice actor, Clarence \"Ducky\" Nash), Donald’s most dominant trait is his fiery temper, which is predominantly expressed through explosive tantrums and fits of quacking and squawking. Much of Donald’s anger stems from his exceptionally bad luck, though his misfortunes are often the karmic result of his own arrogance and greed."
  },
  {
    "name": "Pete",
    "photo": "https://static.wikia.nocookie.net/disney/images/c/ca/Pete_pose.jpg",
    "quote": "Just wait! No one—and I do mean no one—messes with the mighty Pete!",
    "quote_by": "Pete",
    "about": "Pete (commonly known as Peg-Leg Pete) is a villainous, anthropomorphic cat created by Walt Disney and Ub Iwerks. He is the arch-nemesis of Mickey Mouse, normally characterized as a cigar-smoking thug with a ruthless and tyrannical personality. Pete’s most frequent scheme involves kidnapping Minnie Mouse for lecherous purposes, but his crimes and victims have varied over the years."
  },
  {
    "name": "Max Goof",
    "photo": "https://static.wikia.nocookie.net/disney/images/5/56/Max_Goof.png",
    "quote": "",
    "quote_by": "",
    "about": "Maximilian \"Max\" Goof is the son of Goofy. He first appeared in the 1951 short Fathers Are People, as Goofy Junior, and remained a regular in subsequent Goofy shorts of that era. His modern iteration, redesigned and renamed \"Max Goof\", first appeared in the 1992 animated TV series Goof Troop. Since then, Max has appeared in several features, usually alongside Goofy."
  },
  {
    "name": "Huey",
    "photo": "https://static.wikia.nocookie.net/disney/images/6/65/Huey_Ducktales.PNG",
    "quote": "",
    "quote_by": "",
    "about": "In 2017's DuckTales, Huey's role as leader is validated by him being the eldest triplet (by three seconds)[7] and the most responsible. Huey is tactical and has a strict sense of order. He shares Scrooge McDuck's intelligence, but values the safety of others (as well as himself) more so than \"the next big adventure\". As the oldest sibling, Huey often acts as a caretaker for Dewey and Louie when Donald or Scrooge are absent. The younger ducklings look to Huey for comfort, despite the fact that his persnickety attitude can annoy them at times. Along with Dewey and Louie, Huey is also a member of the Junior Woodchucks, though he takes the position much more seriously. Huey usually has the official Junior Woodchuck guidebook by his side at all times, and will consult it when trouble arises. According to co-executive producer Frank Angones, Huey's intelligence is due to him being responsible for paying the bills while living with Donald.[8]"
  },
  {
    "name": "Dewey",
    "photo": "https://static.wikia.nocookie.net/disney/images/a/a0/Dewey_Ducktales.PNG",
    "quote": "",
    "quote_by": "",
    "about": "In the 1987 DuckTales series episode \"Duck in the Iron Mask\", Dewey had an identity crisis, as he wanted to separate himself from the trio to stand out as his own individual. This carried over into the 2017 reboot, in which Dewey's \"middle child syndrome\" has made him obsessed with attention and standing out from the crowd. He typically goes about this by trying to embark on death-defying adventures, alone, as a way to prove himself as someone special. This can drive Dewey to act selfishly at times (he even created the \"Day of the Only Child!\", in which the triplets act as if they have no siblings), but he still cares deeply for his family. Officially, Dewey's full name is Dewford Dingus Duck.[4] In the episode \"The Town Where Everyone Was Nice!\", it is stated that, when the triplets were eggs, Donald dropped one of them while juggling with them. Upon hearing this, Louie and Huey looked at Dewey and nodded at each other, implying that some (if not all) of Dewey's personality traits in the series are product of brain damage."
  },
  {
    "name": "Louie",
    "photo": "https://static.wikia.nocookie.net/disney/images/2/25/Louie_Ducktales.PNG",
    "quote": "",
    "quote_by": "",
    "about": "In 2017's DuckTales, Louie is portrayed as the most laid-back of the brothers. While adventurous in his own right, Louie would much rather loaf around on the couch while watching TV all day. For all his laziness, Louie is also incredibly crafty and intelligent. Like Scrooge, he loves treasure, having grown under the assumption that his life will be easier with more money due to being raised by his broken uncle,[8] but doesn't want to actually put in the work to earn an honest living. Instead, he resorts to creating \"get-rich-quick\" schemes in hopes of making a buck by doing as little work as possible. Louie takes after Gladstone Gander in this regard, whom he affectionately refers to as \"Uncle Gladstone\". Because of his mischievous ways, Huey, Dewey and Webby refer to Louie as the \"evil triplet\", which he takes in stride. Louie has a moral compass, however. Though he loves money, he will never resort to endangering others for the sake of getting it. In fact, Louie is the most vulnerable and emotional of the triplets. Behind his mellow attitude, he is somewhat of a coward, which plays into why he'd rather lounge around at home than partake in Scrooge's adventures."
  }
]
